using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace FoodSys.Enum
{
	/// <summary>
	/// 企业共同申请人
	/// </summary>
	public enum EnumApplyCompanyCoapplicantExcel
	{
		姓名 = 0,
		性别 = 1,
		出生日期 = 2,
		民族 = 3,
		学历 = 4,
		证件类型 = 5,
		证件号码 = 6,
		暂住证编号 = 7,
		劳动合同编号 = 8,
		劳动合同开始日期 = 9,
		劳动合同结束日期 = 10,
		工作部门 = 11,
		职务 = 12,
		工作年限 = 13,
		手机 = 14,
		座机 = 15,
		婚姻状况 = 16,
		户籍地址 = 17,
		现居地址 = 18,
		住房状况 = 19,
		自有住房建筑面积 = 20,
		自有住房人均建筑面积是否大于17平 = 21,
		养老保险是否缴纳 = 22,
		养老保险开始缴纳日期 = 23,
		失业保险是否缴纳 = 24,
		失业保险开始缴纳日期 = 25,
		工伤保险是否缴纳 = 26,
		工伤保险开始缴纳日期 = 27,
		医疗保险是否缴纳 = 28,
		医疗保险开始缴纳日期 = 29,
		生育保险是否缴纳 = 30,
		生育保险开始缴纳日期 = 31,
		住房公积金是否缴纳 = 32,
		住房公积金开始缴纳日期 = 33,
		申请小区 = 34,
		申请房型 = 35
	}

	/// <summary>
	/// 企业员工家庭成员
	/// </summary>
	public enum ApplyCompanyFamiliyMember
	{
		主申请人身份证号码 = 0,
		家庭共同申请人姓名 = 1,
		性别 = 2,
		出生日期 = 3,
		民族 = 4,
		学历 = 5,
		证件类型 = 6,
		证件号码 = 7,
		暂住证编号 = 8,
		手机 = 9,
		座机 = 10,
		婚姻状况 = 11,
		与申请人关系 = 12,
		户籍地址 = 13,
		现居地址 = 14,
		住房状况 = 15,
		自有住房建筑面积 = 16,
		自有住房人均建筑面积是否大于17平 = 17

	}


}
